import random
# ================================
# دانشجو: ساره اخوان بهابادی 
# شماره دانشجویی: 404130333
# عنوان پروژه: شبیه‌ساز جام جهانی
# تاریخ تحویل: 1405/05/04
# ================================
from Match import Match
class Group:
    '''این کلاس یک گروه ۴ تیمی رو نگه می‌داره، بازی‌های داخل گروه رو مدیریت می‌کنه و رتبه‌بندی نهایی رو مشخص می‌کنه'''
#یک متد سازنده است که دوتا پارامتر می گیره و اون رو روی ابجکت خودشون سیو می کنه
    def __init__(self, name, timha):
        self.name = name
        self.timha = timha
#این متد فقط سلف رو می گیره چون هرچی که لازمه از قبل ذخیره شده
    def hame_bazi_ha(self):
  
        #هر تیم فقط یک‌بار با 3 تیم دیگه گروه بازی می‌کنه جمعا 6 بازی
        #طول لیست رو بر می گردونه
        n = len(self.timha)
        #حلقه بیرونی شروع شد
        for i in range(n):
            #این جا از صفر شروع نشد چون میخوایم هر دو تیم فقط یکبار باهم بازی کنن
            for j in range(i+1, n):
                #یک شی جدید از کلاس match می سازیم و مرحله گروهی هستیم
                bazi = Match(self.timha[i], self.timha[j], marhale_hazfi=False)
                #بازی رو اجرا می کنیم
                bazi.bazi_kon() 
             #لیست تیم‌های گروه رو به ترتیب رتبه ,طبق 3 معیار + قرعه‌کشی  برمی‌گردونه   
    def rotbe_bandi(self):
        #یه تابع آماده‌ست که ترتیب یه لیست رو به‌طور تصادفی به‌هم می‌ریزه
        random.shuffle(self.timha)
        #یک تابع اماده پایتونه که یک لیست رو مرتب  می کنه و یک لیست جدید بر می گردونه اصلی رو دست نمیزنه
        timha_moratab = sorted(
            self.timha,
            #وقتی میخوای مرتب کنی برای هر تیم این اعداد رو حساب کن و بر اساس اونا مقایسه کن
            #سه تا عدد رو کنار هم تو یک بسته می ذاره و پایتون از چپ به راست مقایسه می کنه
            key=lambda t: (t.emtiaz, t.tafazol_gol(), t.gol_zade),
            #sortedاز کوچک به بزرگ مرتب می کنه 
            #ما reverse درست می ذاریم که از بزرگ به کوچک مرتب شه
            reverse=True
        )
        #لیست مرتب شده رو بر می گردونیم
        return timha_moratab
#دو تیم اول گروه که به مرحله حذفی می‌رن رو برمی‌گردونه
    def do_tim_bartar(self):
       #متد قبلی یعنی رتبه بندی رو صدا میزنه و در متغیر جدید ذخیره می کنه
        rotbe = self.rotbe_bandi()
        #از این لیست مرتب شده دوتا عنصر اول رو بر می داریم و این دو مقدار رو همزمان بر می گردونیم
        return rotbe[0], rotbe[1]
    
    