# ================================
# دانشجو: ساره اخوان بهابادی 
# شماره دانشجویی: 404130333
# عنوان پروژه: شبیه‌ساز جام جهانی
# تاریخ تحویل: 1405/05/04
# ================================
#این کلاس یک مرحله حذفی مثلا یک‌هشتم یا فینال رو نگه می‌داره، بازی‌هاش رو اجرا می‌کنه و برنده‌ها رو مشخص می‌کنه
class KnockoutStage:


    def __init__(self, marhale_esm, bazi_ha):
        #این سازنده دو تا پارامتر میگیره و هر دو رو روی خود ابجکت ذخیره می کنه
        self.marhale_esm = marhale_esm
        self.bazi_ha = bazi_ha
#متدی که همه بازی های این مرحله رو اجرا می کنه
    def marhale_bazi_kon(self):
      #یک حلقه فور که روی لیست بازی ها حرکت می کنه و بازی  در اینجا خود یکی از  ابجکت  های کلاس matchهست
        for bazi in self.bazi_ha:
            #همون بازی رو واقعا اجرا می کنیم
            bazi.bazi_kon()
#متدی که لیست برنده های این مرحله رو بر می گردونه
    def barande_ha_bede(self):
        #یک لیست خالی می سازیم قراره توش برنده ها رو بزاریم
        barande_ha = []
        
        for bazi in self.bazi_ha:
            #یعنی برنده اون بازی خاص روکه قبلا مشخص شده به اخر لیست اضافه کن
            barande_ha.append(bazi.barande)
            #لیست کامل برنده ها رو بر می گردونیم
        return barande_ha
#نتایج رو چاپ می کنه
    def natije_namayesh(self):
       
        print(f"===== {self.marhale_esm} =====")
        #برای هر بازی توی لیست پرینت بازی رو صدا می زنیم  و چون بازی ابجکته وقتی پرینت میشه میره مستقیم سراغ متد __str__ اون کلاس
        for bazi in self.bazi_ha:
            print(bazi)