# ================================
# دانشجو: ساره اخوان بهابادی 
# شماره دانشجویی: 404130333
# عنوان پروژه: شبیه‌ساز جام جهانی
# تاریخ تحویل: 1405/05/04
# ================================
class Match:
    '''این کلاس یک بازی بین دو تیم رو نگه می‌داره و با صدا زدن متد شبیه‌سازی، نتیجه بازی رو مشخص و ذخیره می‌کنه'''
    #این خط تعریف سازنده هست و 3 تا پارامتر می گیره 
    #سلف و تیم ها و پارامتری که میگه این بازی حذفیه یا نه با مقدار پیش فرض
    def __init__(self, tim1, tim2, marhale_hazfi=False):
        
        # دو تیمی که قراره باهم بازی کنن رو  روی خود ابجکت ذخیره می‌کند
        self.tim1 = tim1
        self.tim2 = tim2
        # متغیر حذفی بودن یا گروهی بودن رو هم ذخیره می کنیم
        self.marhale_hazfi = marhale_hazfi
        # هنوز بازی انجام نشده، پس گل‌ها صفر و برنده نامشخصه
        self.gol1 = 0
        self.gol2 = 0
        self.barande = None
        #  نتیجه شبیه‌سازی رو می‌گیریم و در گل1، گل2 و برنده ذخیره می‌کنیم
    def bazi_kon(self):
      #سمت راست میگه برو  سراغ تیم اول و متد شبیه سازی که در کلاس تیم نوشتیم رو صدا بزن
      #سمت چپ سه تا مقداری که از سمت راست برگشته رو می گیریم و هر کدوم رو در یک متغیر جدا روی خود ابجکت ذخیره می کنیم
        self.gol1, self.gol2, self.barande = self.tim1.shabih_sazi_bazi(self.tim2, marhale_hazfi=self.marhale_hazfi) 
    
    #این متد خاص پایتونه و هر وقت بخوای ابجکت پرینت کنیم یا به رشته تبدیل کنی صدا زده میشه
    def __str__(self):
        
       natije = f"{self.tim1.name} {self.gol1} - {self.gol2} {self.tim2.name}"
    #ایا مقداری داره؟
       if self.barande:
        #اگر برنده معلوم بود به رشته قبلی این متن رو می چسبونیم
        natije += f" -> برنده: {self.barande.name}"
        #رشته رو کامل بر می گردونیم
       return natije    
   


